Revit 2026 API

# ACADExportOptionsLinetypesFileName Property

---

The custom linetype file name (*.lin). Default value is empty.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string LinetypesFileName { get; set; }
```
```vb
Public Property LinetypesFileName As String
	Get
	Set
```
```cpp
public:
property String^ LinetypesFileName {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member LinetypesFileName : string with get, set
```

#### Property Value

String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

#### Reference

ACADExportOptions Class

Autodesk.Revit.DB Namespace